configuration/src/InformationRegisters/ВерсииАссетов/ВерсииАссетов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ВерсииАссетов</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <resources>
    <name>Версия</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Обновлен</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <dimensions>
    <name>ТипАссетов</name>
    <type>
      <types>CatalogRef.ТипыАссетов</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

configuration/src/Catalogs/ИнструментыСистемы/ИнструментыСистемы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ИнструментыСистемы</name>
  <hierarchical>true</hierarchical>
  <predefined>
    <items>
      <name>Добавить</name>
      <description>Добавить</description>
    </items>
    <items>
      <name>Закрепленные</name>
      <description>Закрепленные</description>
    </items>
    <items>
      <name>Контроль</name>
      <description>Контроль</description>
    </items>
    <items>
      <name>Мои</name>
      <description>Мои</description>
    </items>
    <items>
      <name>МоиНастройки</name>
      <description>Мои настройки</description>
    </items>
    <items>
      <name>НастройкаПроцессаФилиала</name>
      <description>Настройка процесса филиала</description>
    </items>
    <items>
      <name>Отчеты</name>
      <description>Отчеты</description>
    </items>
    <items>
      <name>Планирование</name>
      <description>Планирование</description>
    </items>
    <items>
      <name>Прочие</name>
      <description>Прочие</description>
    </items>
    <items>
      <name>СпискиДокументов</name>
      <description>Списки документов</description>
    </items>
    <items>
      <name>Трудозатраты</name>
      <description>Трудозатраты</description>
    </items>
    <items>
      <name>Управление</name>
      <description>Управление</description>
    </items>
    <items>
      <name>УправлениеУслугами</name>
      <description>Управление услугами</description>
    </items>
  </predefined>
  <attributes>
    <name>БыстрыйДоступ</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидОбъекта</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЕстьСчетчик</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Иконка</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ИмяДляБыстрогоДоступа</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>МетодОпределенияДоступности</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>МетодРасчетаСчетчика</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОбъектМетаданных</name>
    <type>
      <types>CatalogRef.ИдентификаторыОбъектовМетаданных</types>
    </type>
  </attributes>
  <attributes>
    <name>Порядок</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

configuration/src/Catalogs/ИдентификаторыОбъектовМетаданных/ИдентификаторыОбъектовМетаданных.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ИдентификаторыОбъектовМетаданных</name>
  <hierarchical>true</hierarchical>
  <predefined>
    <items>
      <name>Документ</name>
      <description>Документ</description>
    </items>
    <items>
      <name>Константа</name>
      <description>Константа</description>
    </items>
    <items>
      <name>Обработка</name>
      <description>Обработка</description>
    </items>
    <items>
      <name>ОбщаяКоманда</name>
      <description>ОбщаяКоманда</description>
    </items>
    <items>
      <name>ОбщаяФорма</name>
      <description>ОбщаяФорма</description>
    </items>
    <items>
      <name>Отчет</name>
      <description>Отчет</description>
    </items>
    <items>
      <name>Перечисление</name>
      <description>Перечисление</description>
    </items>
    <items>
      <name>ПланВидовХарактеристик</name>
      <description>ПланВидовХарактеристик</description>
    </items>
    <items>
      <name>ПланОбмена</name>
      <description>ПланОбмена</description>
    </items>
    <items>
      <name>РегистрНакопления</name>
      <description>РегистрНакопления</description>
    </items>
    <items>
      <name>РегистрСведений</name>
      <description>РегистрСведений</description>
    </items>
    <items>
      <name>Справочник</name>
      <description>Справочник</description>
    </items>
  </predefined>
  <attributes>
    <name>Идентификатор</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Использование</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПолноеИмяФормы</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Тип</name>
    <type>
      <types>EnumRef.ТипыМетаданных</types>
    </type>
  </attributes>
</mdclass:Catalog>

configuration/src/Catalogs/Филиалы/Филиалы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Филиалы</name>
  <hierarchical>true</hierarchical>
  <hierarchyType>HierarchyOfItems</hierarchyType>
  <predefined>
    <items>
      <name>КастомныеКоманды</name>
      <description>Кастомные команды</description>
    </items>
  </predefined>
  <attributes>
    <name>ITСтруктура</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗаместительРуководителя</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Руководитель</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Территория</name>
    <type>
      <types>CatalogRef.Территории</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипФилиала</name>
    <type>
      <types>EnumRef.ТипыФилиалов</types>
    </type>
  </attributes>
  <attributes>
    <name>УдаленВИсточнике</name>
    <comment>Устанавливается в Истину, если обменом пришло Удаление объекта.</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьКраткоеНаименование</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьНаименованиеПолное</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьОбщийКаналRocketChat</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЮридическоеЛицо</name>
    <type>
      <types>CatalogRef.ЮридическиеЛица</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ИерархияТерриторий</name>
    <attributes>
      <name>Территория</name>
      <type>
        <types>CatalogRef.Территории</types>
      </type>
    </attributes>
    <attributes>
      <name>Уровень</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>2</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>РазрабатываемыеСистемы</name>
    <attributes>
      <name>Система</name>
      <type>
        <types>CatalogRef.СистемыУчета</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

configuration/src/CommonModules/ИнструментыСервер/Module.bsl
///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2025, ООО ДНС Технологии
// SDMS (Software Development Management System) — это корпоративная система учета разработки и управления проектами 
// Все права защищены. Эта программа и сопроводительные материалы предоставляются 
// в соответствии с условиями лицензии General Public License (GNU GPL v3)
// Текст лицензии доступен по ссылке:
// https://www.gnu.org/licenses/gpl-3.0.html
///////////////////////////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

// Создает реквизиты для подключения фонового обновления данных инструмента
//
// Параметры:
//  Форма	 - ФормаКлиентскогоПриложения - форма инструмента
//
Процедура ПриСозданииНаСервере(Форма, ОбновляемаяТаблица, Автообновление = Истина) Экспорт
	
	Модуль = УправлениеИнструментамиРазработкиКлиентСервер;
	
	РеквизитАвтообновление = Новый РеквизитФормы(Модуль.ИмяРеквизитаАвтообновление(), Новый ОписаниеТипов("Булево"));
	РеквизитИмяСтраницы = Новый РеквизитФормы(Модуль.ИмяРеквизитаСтраницаИнструмента(), Новый ОписаниеТипов("Строка"));
	
	ДобавляемыеРеквизиты = Новый Массив;
	ДобавляемыеРеквизиты.Добавить(РеквизитАвтообновление);
	ДобавляемыеРеквизиты.Добавить(РеквизитИмяСтраницы);
		
	Если Автообновление Тогда
		РеквизитДатаОбновления = Новый РеквизитФормы(Модуль.ИмяРеквизитаДатаОбновления(), Новый ОписаниеТипов("Дата"));
		РеквизитТребуетсяОбновление = Новый РеквизитФормы(Модуль.ИмяРеквизитаТребуетсяОбновление(), Новый ОписаниеТипов("Булево"));
		
		ДобавляемыеРеквизиты.Добавить(РеквизитДатаОбновления);
		ДобавляемыеРеквизиты.Добавить(РеквизитТребуетсяОбновление);
	КонецЕсли;
	
	ТипПараметра = ТипЗнч(ОбновляемаяТаблица);
	
	Если ТипПараметра = Тип("Массив") Тогда
		Для Каждого Таблица Из ОбновляемаяТаблица Цикл
			НовыйРеквизит = Новый РеквизитФормы(Модуль.ИмяРеквизитаРезультат(Таблица), Новый ОписаниеТипов("Строка"));
			ДобавляемыеРеквизиты.Добавить(НовыйРеквизит);
		КонецЦикла;
	Иначе
		НовыйРеквизит = Новый РеквизитФормы(Модуль.ИмяРеквизитаРезультат(ОбновляемаяТаблица), Новый ОписаниеТипов("Строка"));
		ДобавляемыеРеквизиты.Добавить(НовыйРеквизит);
	КонецЕсли;
	
	Форма.ИзменитьРеквизиты(ДобавляемыеРеквизиты);
	
	Если ТипПараметра = Тип("Массив") Тогда
		Для Каждого Таблица Из ОбновляемаяТаблица Цикл
			Форма[Модуль.ИмяРеквизитаРезультат(Таблица)] = ПоместитьВоВременноеХранилище(Неопределено, Форма.УникальныйИдентификатор);
		КонецЦикла;
	Иначе
		Форма[Модуль.ИмяРеквизитаРезультат(ОбновляемаяТаблица)] = ПоместитьВоВременноеХранилище(Неопределено, Форма.УникальныйИдентификатор);
	КонецЕсли;
	
	Форма[Модуль.ИмяРеквизитаАвтообновление()] = Автообновление;
	
КонецПроцедуры

// Передает данные из фонового задания клиенту
// 
// Параметры:
//  ДанныеИнструмента - Массив - подготовленные для передачи данные
//  АдресРезультата - Строка - Адрес результата
//  УИДЗамера - Строка - УИДЗамера
//  ДанныеСчетчика - Неопределено, Структура - Данные счетчика
Процедура ОповеститьИнструментОбОбновлении(ДанныеИнструмента = "", АдресРезультата = "", УИДЗамера = "", ДанныеСчетчика = Неопределено) Экспорт
	
	ДанныеУведомления = Новый Структура("ДанныеДерева, УИДЗамера", ДанныеИнструмента, УИДЗамера);
	
	Если ДанныеСчетчика <> Неопределено Тогда
		ДанныеУведомления.Вставить("ДанныеСчетчика", ДанныеСчетчика);
	КонецЕсли;
	
	ПоместитьВоВременноеХранилище(ДанныеУведомления, АдресРезультата);
	
	ФоновоеЗадание = ПолучитьТекущийСеансИнформационнойБазы().ПолучитьФоновоеЗадание();
	
	Адресаты = Новый Массив;
	Адресаты.Добавить(ФоновоеЗадание.НомерРодительскогоСеанса);
	
	УведомленияКлиента.ОтправитьУведомление(ФоновоеЗадание.Ключ, ДанныеУведомления, Адресаты);
	
КонецПроцедуры

// Сериализует дерево или таблицу. Выкидывает поля с незаполненными значениями.
//
// Параметры:
//  Данные				 - ТаблицаЗначений, ДеревоЗначений - данные инструмента
//  КолонкиИнструмента	 - Массив - список колонок инструмента
// 
// Возвращаемое значение:
//  Массив - подготовленные для передачи данные
//
Функция ПодготовитьДанныеИнструментаДляКлиента(Данные, КолонкиИнструмента) Экспорт
	
	Результат = Новый Массив;
	ЭтоДерево = (ТипЗнч(Данные) = Тип("ДеревоЗначений"));
	
	ДанныеДляОбхода = ?(ЭтоДерево, Данные.Строки, Данные);
	
	Для Каждого Строка Из ДанныеДляОбхода Цикл
		ДанныеСтроки = Новый Структура;
		
		Для Каждого Колонка Из КолонкиИнструмента Цикл
			ЗначениеСвойства = Строка[Колонка];
			
			Если ЗначениеЗаполнено(ЗначениеСвойства) Тогда
				ДанныеСтроки.Вставить(Колонка, ЗначениеСвойства);
			КонецЕсли;
		КонецЦикла;
		
		Если ЭтоДерево Тогда
			ОбработатьПодстрокиДерева(ДанныеСтроки, Строка.Строки, КолонкиИнструмента);
		КонецЕсли;
		
		Результат.Добавить(ДанныеСтроки);
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

Функция ПолучитьДанныеДляПанелиИнструментов() Экспорт
	
	Версия = РегистрыСведений.ВерсииАссетов.ПолучитьТекущуюВерсию(Справочники.ТипыАссетов.НавигационнаяПанель);
	
	Данные = Новый Структура("method, version", "startClient", Версия);
	Данные.Вставить("tools", Справочники.ИнструментыСистемы.СписокИнструментов());
	Данные.Вставить("styles", ИнтерфейсПриложения.ПолучитьДанныеСтилейПодсказок());
	Данные.Вставить("userGUID", XMLСтрока(ПараметрыСеанса.ТекущийПользователь));
	
	Возврат Данные;
	
КонецФункции

// Получить идентификатор инструмента
// 
// Параметры:
//  ОбъектМетаданных - ОбъектМетаданных - Объект метаданных
// 
// Возвращаемое значение:
//  Строка - идентификатор инструмента
Функция ПолучитьИдентификаторИнструмента(Знач ОбъектМетаданных) Экспорт
	
	Результат = "";
	
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	ИнструментыСистемы.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.ИнструментыСистемы КАК ИнструментыСистемы
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ИдентификаторыОбъектовМетаданных КАК ИдентификаторыОбъектовМетаданных
	|		ПО ИнструментыСистемы.ОбъектМетаданных = ИдентификаторыОбъектовМетаданных.Ссылка
	|ГДЕ
	|	ИдентификаторыОбъектовМетаданных.ПолноеИмяФормы = &ПолноеИмяМетаданных
	|	И ИнструментыСистемы.ЕстьСчетчик";

	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.УстановитьПараметр("ПолноеИмяМетаданных", ОбъектМетаданных.ПолноеИмя());
	
	Выборка = Запрос.Выполнить().Выбрать();

	Если Выборка.Следующий() Тогда
		Результат = XMLСтрока(Выборка.Ссылка);
	КонецЕсли;

	Возврат Результат;
	
КонецФункции

Функция ПолучитьОсновнойИнструмент(Знач Пользователь) Экспорт
	
	ОсновнойИнструмент = Справочники.ИнструментыСистемы.ПолучитьОсновнойИнструмент(Пользователь);
	
	Если НЕ ЗначениеЗаполнено(ОсновнойИнструмент) Тогда
		Справочники.ИнструментыСистемы.ЗаполнитьНастройкиПользователяПоУмолчанию(Пользователь);
		ОсновнойИнструмент = Справочники.ИнструментыСистемы.ПолучитьОсновнойИнструмент(Пользователь);
	КонецЕсли;
	
	Возврат ОсновнойИнструмент;
	
КонецФункции

Функция ПроверитьДоступность(ДанныеИнструмента, ЭтоАдминистратор, ТекущийПользователь, ОбъектМетаданных = Неопределено) Экспорт
	
	Доступность = Истина;
	
	Если НЕ ЭтоАдминистратор Тогда
		Если ОбъектМетаданных <> Неопределено Тогда
			Доступность = ПравоДоступа("Просмотр", ОбъектМетаданных);
		КонецЕсли;
		
		Если Доступность И ЗначениеЗаполнено(ДанныеИнструмента.МетодОпределенияДоступности) Тогда
			ШаблонМетода = СтрШаблон("Доступность = %1(ТекущийПользователь)", ДанныеИнструмента.МетодОпределенияДоступности);
			
			Попытка
				Выполнить(ШаблонМетода);
			Исключение
				Доступность = Ложь;
				ТекстОшибки = СтрШаблон("%1. %2", ДанныеИнструмента.МетодОпределенияДоступности, ОписаниеОшибки());
				ЗаписьЖурналаРегистрации("Инструменты.Проверка доступности", УровеньЖурналаРегистрации.Ошибка, ,
				ДанныеИнструмента.Ссылка, ТекстОшибки);
			КонецПопытки;
		КонецЕсли;
	КонецЕсли;
	
	Возврат Доступность;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ДоступностьГабаритноеПланирование(Знач ТекущийПользователь)
	
	Возврат Справочники.Филиалы.ИспользуетсяГабаритноеПланирование(ПараметрыСеанса.Филиал);
	
КонецФункции

Функция ДоступностьГрупповоеВнесениеТрудозатрат(Знач ТекущийПользователь)
	
	Возврат БезопасностьПереопределяемый.ПравоИспользованияГрупповогоВнесенияТрудозатрат();
	
КонецФункции

Функция ДоступностьКастомныеКоманды(Знач ТекущийПользователь)
	
	Возврат Безопасность.НаходитсяВГруппеДоступа(Справочники.ГруппыДоступа.СТОиРуководителиITНаправлений,
		ТекущийПользователь);
	
КонецФункции

Функция ДоступностьМойПрофиль(Знач ТекущийПользователь)
	
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	ПрофилиРазработчиков.Ссылка КАК Профиль
	|ИЗ
	|	Справочник.ПрофилиРазработчиков КАК ПрофилиРазработчиков
	|ГДЕ
	|	ПрофилиРазработчиков.Владелец = &Владелец
	|	И НЕ ПрофилиРазработчиков.ПометкаУдаления";
	
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.УстановитьПараметр("Владелец", ТекущийПользователь);
	Результат = НЕ Запрос.Выполнить().Пустой();
	
	Возврат Результат;
	
КонецФункции

Функция ДоступностьНастройкиФилиалов(Знач ТекущийПользователь)
	
	Результат = Истина;
	
	Если НЕ РольДоступна(Метаданные.Роли.РуководительНаправления) Тогда
		ТекстЗапроса =
		"ВЫБРАТЬ
		|	Филиалы.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.Филиалы КАК Филиалы
		|ГДЕ
		|	Филиалы.Родитель = ЗНАЧЕНИЕ(Справочник.Филиалы.ПустаяСсылка)
		|	И (Филиалы.Руководитель = &Пользователь
		|			ИЛИ Филиалы.ЗаместительРуководителя = &Пользователь)";
		
		Запрос = Новый Запрос(ТекстЗапроса);
		Запрос.УстановитьПараметр("Пользователь", ТекущийПользователь);
		
		Результат = НЕ Запрос.Выполнить().Пустой();
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ДоступностьНастройкиJira(Знач ТекущийПользователь)
	
	Возврат РольДоступна(Метаданные.Роли.УправлениеНастройкамиИнтеграцииJira);
	
КонецФункции

Функция ДоступностьПрофилиСотрудников(Знач ТекущийПользователь)
	
	Возврат БезопасностьПереопределяемый.ПравоИспользованиеПрофиляРазработчика(Неопределено);
	
КонецФункции

Функция ДоступностьУправлениеУслугами(Знач ТекущийПользователь)
	
	Возврат Ложь;
	
КонецФункции

Процедура ОбработатьПодстрокиДерева(Результат, Строки, КолонкиИнструмента)
	
	Если Строки.Количество() > 0 Тогда
		Результат.Вставить("ПодчиненныеСтроки", Новый Массив);
		
		Для Каждого Строка Из Строки Цикл
			ДанныеСтроки = Новый Структура;
			
			Для Каждого Колонка Из КолонкиИнструмента Цикл
				ЗначениеСвойства = Строка[Колонка];
				
				Если ЗначениеЗаполнено(ЗначениеСвойства) Тогда
					ДанныеСтроки.Вставить(Колонка, ЗначениеСвойства);
				КонецЕсли;
			КонецЦикла;
			
			ОбработатьПодстрокиДерева(ДанныеСтроки, Строка.Строки, КолонкиИнструмента);
			
			Результат.ПодчиненныеСтроки.Добавить(ДанныеСтроки);
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

Функция ДоступностьУправленияЦелями(Знач ТекущийПользователь)
	
	Возврат РольДоступна(Метаданные.Роли.УправлениеЦелямиOKR);
	
КонецФункции

#КонецОбласти
